'use client';
import styles from './about.module.css';

function About() {
    return (
        <div className={styles.aboutContainer}>
          <h1 className={styles.title}>...אז קצת עלי</h1>
          <p className={styles.aboutContent}>חנה גולדמינץ. גרה בשבי שומרון ואמא לשמונה ילדים מתוקים. 
            בעבודתי אני מרכזת מרכז לזהות יהודית בנתניה - אני מפעילה מערך חוגים בנושאים סיפורי תורה וסיפורי חז"ל בגנים ממלכתיים.
            על מנת לשמור על הפשטות, כל משחקי הבריחה שלי בנויים באותו פורמט:
            הקבוצה מתחלקת לתת-קבוצות של 6 משתתפים, כל תת-קבוצה מקבלת פלקט גדול וכרטיס מלווה. 
            בעזרת ההנחיה שלי פותרים חידות ומבצעים משימות. 
            תכנית החידות והמשימות מותאמת לעלילה מסויימת. נראה איזו קבוצה תגיע ראשונה אל פתרון העלילה ותקבל את הקוד הסודי, בעזרתו היא תוכל לפתוח את תיבת האוצר...
            החידות מכילות: תסכיתים (השמעת הקלטה), תפזורות, מבוכים, מציאת הבדלים בין איורים, פאזלים, מפה אילמת ועוד...
            כמובן שניתן גם להפעיל את חדר הבריחה גם במפגשים משפחתיים, מסיבות יום הולדת, ובכל ארוע שתבחרו.
            משחקי הבריחה שלי מגוונים ומתאימים לכל הציבורים: דתי, חרד"לי, חרדי וגם חילוני. כולם נהנים ורוצים עוד.
            *כל התכניות שלי מוכרות בגפן
          </p>
          <div className={styles.link_escapeRooms}>
            <p>?רוצים להציץ אל חדרי הבריחה שלי</p>
            <a href="/rooms">!לחצו כאן</a>
          </div>
          <a href="/contact" className={styles.contactButton}>ליצירת קשר</a>
        </div>
      );
}

export default About;